Repository: wescamp/A_Simple_Campaign-1.12
Catalog: po/*.po
Languages: ru, sk

source: A Simple Campaign
ru: Простейшая кампания
sk: Jednoduchá Kampaň

source: ASC
ru: ПРК
sk: JK

source: &units/undead-necromancers/adept-magic-3.png=Easy;*&units/undead-necromancers/dark-sorcerer-attack-staff-2.png=Medium;&units/undead-necromancers/ancient-lich-magic-3.png=Difficult
ru: &units/undead-necromancers/adept-magic-3.png=Легко;*&units/undead-necromancers/dark-sorcerer-attack-staff-2.png=Средне;&units/undead-necromancers/ancient-lich-magic-3.png=Трудно
sk: &units/undead-necromancers/adept-magic-3.png=Ľahké;*&units/undead-necromancers/dark-sorcerer-attack-staff-2.png=Stredné;&units/undead-necromancers/ancient-lich-magic-3.png=Ťažké

source: This is a stub of a campaign, intended to make life easier in creating a campaign. Contains about the bare minimum that's needed for a campaign and some helpful comments.
ru: Это скелет кампании, выпущенный, что бы облегчить жизнь создателям кампаний. Он содержит необходимый минимум, требующийся для разработки кампании и некоторые полезные комментарии.
sk: Toto je kratučká kapmaň, ktorá je určená pre zjednodušenie práce pri tvorbe skutočných kampaní. Obsahuje úplný základ, ktorý je potrebný pre tvorcov príbehov a niekoľko užitočných komentárov.

source: this is where the story goes
ru: тут начинается история
sk: tu začína príbeh

source: Template
ru: Шаблон
sk: Šablóna

source: His Awesomeness
ru: Его Превосходительство
sk: Pán Úžasný

source: Lord Awesomeness
ru: Милорд Превосходный
sk: Lord Úžasný

source: Welcome, future UMC developer. This is a stub of a campaign, intended to make life easier in creating a campaign, since the by far most difficult part is the very start. This campaign contains about the bare minimum that's needed for a campaign and some helpful comments.
ru: Добро пожаловать, будущий разработчик пользовательских кампаний. Это скелет кампании, созданный для облегчения разработки, и сейчас начнётся самое трудное. Эта кампания содержит необходимый минимум, требующийся для разработки и некоторые полезные комментарии.
sk: Vitaj, budúci UMC vývojár. Toto je kratučká kapmaň, ktorá je určená pre zjednodušenie práce pri tvorbe skutočných kampaní. Obsahuje úplný základ, ktorý je potrebný pre tvorcov príbehov a niekoľko užitočných komentárov.

source: There is a site in the wesnoth wiki related to this add-on, which also tells you where to look for this add-on's files so you can actually read this message in the code instead of reading it on the screen: http://wiki.wesnoth.org/BuildingCampaignsTutorial/FirstCampaign
ru: Вот ссылка на вики-страницу, связанную с данным дополнением, на которой написано, где искать файлы данного дополнения, так что вы можете найти это сообщение в коде, вместо того, что бы перепечатывать его с экрана: http://wiki.wesnoth.org/BuildingCampaignsTutorial/FirstCampaign
sk: Na Wesnoth Wiki je stránka, ktorá zaoberá špeciálne tvorbou kampaní. Text, ktorý čítaš v tomto okamihu, si môžeš prečítať aj priamo v kóde kampane, nielen v grafickom rozhraní hry. Navštív stránku http://wiki.wesnoth.org/BuildingCampaignsTutorial/FirstCampaign

source: site related to this add-on: http://wiki.wesnoth.org/BuildingCampaignsTutorial/FirstCampaign
ru: сайт, связанный с этим дополнением: http://wiki.wesnoth.org/BuildingCampaignsTutorial/FirstCampaign
sk: stránka previazaná s týmto doplnkom: http://wiki.wesnoth.org/BuildingCampaignsTutorial/FirstCampaign

source: However, I don't update that site so probably nobody does...
ru: Но понимаешь, я давно не обновлял эту страницу, и наверняка ни кто ей не занимался...
sk: Aj keď... ja sa o to nestarám a pravdepodobne asi nikto...

source: The files of this add-on, describing what happens in it, are in your userdata directory, explanation where this directory is here: http://wiki.wesnoth.org/EditingWesnoth
ru: Файлы дополнения, описывающие, что в нем происходит, находятся в твоей папке с пользовательскими данными. Пояснения, как найти эту папку, тут: http://wiki.wesnoth.org/EditingWesnoth
sk: Súbory v tomto doplnku sa nachádzajú v osobnom priečinku. Stránka http://wiki.wesnoth.org/EditingWesnoth vysvetlí kde presne to je.

source: Where are the files of this add-on ? read here: http://wiki.wesnoth.org/EditingWesnoth
ru: Где файлы этого дополнения? Читай тут: http://wiki.wesnoth.org/EditingWesnoth
sk: Kde sa nachádzajú súbory tohto doplnku? Prečítaj si tu: http://wiki.wesnoth.org/EditingWesnoth

source: final objectives:
ru: конечные цели:
sk: Cieľ hry:

source: Defeat the enemy leader
ru: Одолейте вражеского предводителя
sk: Porazíš nepriateľského veliteľa

source: Death of His Awesomenes
ru: Смерть Его Превосходительства
sk: Zomrie Pán Úžasný (tvoj veliteľ)

source: Hey, I'm a custom unit of this campaign and I've just appeared.
ru: Опа, я обычный боец данной кампании и я только что появился.
sk: Servus kámo! Som vytvorená jednotka a práve som sa tu akosi objavil!

source: I'm a unit on side 1 and have just moved to the hex with coordinates $x1,$y1.
ru: Я боец стороны 1 и только что передвинулся на клетку с координатами $x1,$y1.
sk: Podľa scenára mám byť na strane 1 (side=1) a práve som sa (dobrovoľne nasilu) presunul na políčko, ktoré má súradnice $x1,$y1.

source: Let's play some custom sound...
ru: Давай сыграем какой-нибудь звук...
sk: Prehrajme si teraz nejaký zvuk.

source: This is the macro from macros/. Soon follows another macro. The code from this event is a bit more adanced wml. You don't need to understand it if you've just started to code wml.
ru: Это макрос из macros/. Скоро запустится ещё один. Код данного события немного более продвинут в wml. Тебе не нужно разбираться с ним, если ты только начал кодить в wml.
sk: Toto je jedno z makier. Čoskoro začne ďalšie makro. Kód tejto udalosti (event) je trochu viac pokročilé WML. Nie je nutné kompletne tomu rozumieť, ak s WML len začínaš.

source: two times three is $twotimesthree|.
ru: два раз а по три будет $twotimesthree|.
sk: Ukážka jednoduchej matematiky. Ak vynásobíme čísla 2 a 3, získame číslo $twotimesthree|.

source: Since the variable twotimesthree is cleared now, you can no longer query it: $twotimesthree| You should always clear your variables once that you no longer need them.
ru: Поскольку переменная twotimesthree теперь очищена, ты не можешь запрягать её: $twotimesthree| Ты должен <b>всегда</b> очищать свои переменные, если они больше не нужны.
sk: Pretože premenná dva krát tri (twotimesthree) je teraz vyriešená, nepotrebuješ ju stále skladovať: $twotimesthree| Mal by si sa vždy zbaviť premenných, ktoré už nebudeš potrebovať.

source: ASC's custom terrain
ru: обычная для ПРК местность
sk: Nový terén Jednoduchej Kampane

source: some custom unit
ru: несколько обычных бойцов
sk: nejaká vlastná jednotka

source: This is a custom unit in ASC demonstrating how to create such units.
ru: Это обычный боец из ПРК, демонстрирующий как создавать подобных бойцов.
sk: Toto je vlastná jednotka v JK, ktorá demonštruje vytváranie takýchto jednotiek.

source: Sword
ru: Меч
sk: Meč

source: This is the macro from utils/. Let's calculate a bit and return the result. This macro is a bit more advanced, you don't need to care about it at the beginning.
ru: Это макрос из utils/. Давай немноо посчитаем и возвратим результат. Этот макрос - продвинутый, тебе не стоит разбираться в нём с самого начала.
sk: Toto je makro z utils/. Spočítajme niečo a vráťme výsledok. Makro je trochu náročnejšie, na začiatku sa tomu nemusíš veľmi venovať.

source: Variable with name two has been set to $two|.
ru: Переменная с именем два установлена в $two|.
sk: Premenná s menom dva bola nastavená na $two|.

source: Variable with name two has been multiplied by 3 to value $two|.
ru: Переменная с именем два была умножена на 3 в two $значение|.
sk: Premenná s menom dva bola násobená číslom 3 na hodnotu $two|.
